vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT1172_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT1172</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="17.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.0.0" date="2022-09-28">NXP CMSIS Packs based on MCUXpresso SDK 2.12.1</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.1.0" date="2021-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
    <release version="13.0.1" date="2021-05-19">NXP CMSIS Packs based on MCUXpresso SDK 2.9.2</release>
    <release version="13.0.0" date="2021-02-23">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT1172" Dvendor="NXP:11">
      <description>
        MIMXRT1172: i.MX® MIMXRT1172 1GHz, 2MB RAM Microcontrollers (MCUs) based on ARM® Cortex®-M7 Core
      </description>
      <device Dname="MIMXRT1172xxxxx">
        <processor Dcore="Cortex-M7" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="1000000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="dpstart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              __var select = 0;
            </block>
            <control if="__ap==1">
              <block>select = 0x01000000;</block>
            </control>
            <block>
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, select);
              
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
              </control>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
            </control>
          </sequence>
          <sequence name="DebugPortStart">
            <block>
              __var reg;
              
              __ap = 0;
              Sequence("dpstart");
              
              //release cm4
              WriteAP(0x4, 0x40c04000);
              WriteAP(0xC, 1);
              
              //change reset mode of cm4
              WriteAP(0x4, 0x40c04004);
              reg = ReadAP(0xC);
              reg &amp;= ~(0x3 &lt;&lt; 10);
              reg |= (0x1 &lt;&lt; 10);
              WriteAP(0xC, reg);
              
              // setup debug port for CM4
              __ap=1;
              Sequence("dpstart");
            </block>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00200000" size="0x040000" access="rx" default="1"/>
        <memory name="SRAM_DTC_cm7" start="0x20000000" size="0x040000" access="rw" default="1"/>
        <memory name="SRAM_ITC_cm7" start="0x00000000" size="0x040000" access="rw" default="1"/>
        <memory name="SRAM_OC1" start="0x20240000" size="0x080000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x202c0000" size="0x080000" access="rw" default="1"/>
        <memory name="SRAM_OC_ECC1" start="0x20340000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM_OC_ECC2" start="0x20350000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM_OC_cm7" start="0x20360000" size="0x020000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1172/arm/MIMXRT117x_QuadSPI_4KB_SEC.FLM" start="0x30000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1172/arm/MIMXRT117x_64MB_QuadSPI_4KB_SEC.FLM" start="0x30000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <debug svd="devices/MIMXRT1172/MIMXRT1172.xml"/>
        <variant Dvariant="MIMXRT1172DVMAA">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172DVMAA"/>
        </variant>
        <variant Dvariant="MIMXRT1172AVM8A">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172AVM8A"/>
        </variant>
        <variant Dvariant="MIMXRT1172CVM8A">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172CVM8A"/>
        </variant>
        <variant Dvariant="MIMXRT1172DVMAB">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172DVMAB"/>
        </variant>
        <variant Dvariant="MIMXRT1172AVM8B">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172AVM8B"/>
        </variant>
        <variant Dvariant="MIMXRT1172CVM8B">
          <compile header="devices/MIMXRT1172/fsl_device_registers.h" define="CPU_MIMXRT1172CVM8B"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT1172.internal_condition">
      <accept Dname="MIMXRT1172AVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1172AVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1172CVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1172CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1172DVMAA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1172DVMAB" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
