vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.flexspi, driver.romapi, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.flexspi, driver.romapi, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.flexspi, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.flexspi, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="allOf.boards=evkbmimxrt1170.condition_id">
      <require condition="boards.evkbmimxrt1170.internal_condition"/>
    </condition>
    <condition id="boards.evkbmimxrt1170.internal_condition">
      <accept condition="device.MIMXRT1171.internal_condition"/>
      <accept condition="device.MIMXRT1172.internal_condition"/>
      <accept condition="device.MIMXRT1173.internal_condition"/>
      <accept condition="device.MIMXRT1175.internal_condition"/>
      <accept condition="device.MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyar8031.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phydp8384x.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phygpy215.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyksz8041.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyksz8081.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phylan8720a.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phylan8741.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8201.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8211f.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phytja1100.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phytja1120.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyvsc8541.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.phyyt8521.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.pit, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.pit_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.anyOf=driver.common, driver.pgmc, driver.ssarc, component.lists, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.common, driver.pgmc, driver.ssarc, component.lists, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.common, driver.pgmc, driver.ssarc.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.common, driver.pgmc, driver.ssarc.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="pgmc"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="ssarc"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
