vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.csi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.dac12.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dsi-cmd.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-elcdif.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.elcdif, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.elcdif, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="elcdif"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-lcdifv2.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdifv2, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdifv2, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lcdifv2"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dcdc_2.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.dcic.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.display-adv7535.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.video-i2c, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.display-co5300.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
