vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1172.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mecc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.memory.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mipi_csi2rx.condition_id">
      <require condition="allOf.driver.common, driver.mipi_csi2rx_soc, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_csi2rx_soc, device_id=MIMXRT1172xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx"/>
      <require condition="device_id.MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mipi_csi2rx_soc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_soc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_split.condition_id">
      <require condition="allOf.driver.common, driver.mipi_csi2rx_soc, driver.mipi_dsi_soc, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_csi2rx_soc, driver.mipi_dsi_soc, device_id=MIMXRT1172xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi"/>
      <require condition="device_id.MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.mu.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.nic301.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.ocotp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1172.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1172.internal_condition"/>
    </condition>
    <condition id="driver.pdm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1172xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.pdm_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.pdm, device=MIMXRT1172.internal_condition"/>
    </condition>
