vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1172_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1172_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1172/MIMXRT1172.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1172/MIMXRT1172_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1172/MIMXRT1172_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ADC_ETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_LDO_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_LDO_SNVS_DIG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_MISC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_OSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ANADIG_TEMPSENSOR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ASRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_AUDIO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CAAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CAN_WRAPPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CCM_OBS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_CSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DCIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DMAMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DSI_HOST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DSI_HOST_APB_PKT_IF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DSI_HOST_DPI_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_DSI_HOST_NXP_FDSOI28_DPHY_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ENC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ENET_QOS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_ETHERNET_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_FLEXRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_GPC_CPU_MODE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_GPC_SET_POINT_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_GPC_STBY_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IEE_APC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC_LPSR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC_LPSR_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IOMUXC_SNVS_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_IPS_DOMAIN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_KEY_MANAGER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_KPP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LCDIFV2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LMEM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_MECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_MIPI_CSI2RX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_MMCAU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_OSC_RC_400M.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PGMC_BPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PGMC_CPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PGMC_MIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PGMC_PPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PHY_LDO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_PXP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_RDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_RDC_SEMAPHORE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SEMA4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SSARC_HP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_SSARC_LP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_TMPSNS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_VIDEO_MUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_VIDEO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_VMBANDGAP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_WDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_XBARA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_XBARB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_XECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1172/periph/PERI_XRDC2.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT1172/"/>
        <file category="include" name="devices/MIMXRT1172/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1172/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1172/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1172/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1172/xip/"/>
      </files>
    </component>
