vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1172_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1172_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/arm/MIMXRT1172xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1172/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/arm/MIMXRT1172xxxxx_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1172/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/arm/MIMXRT1172xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1172/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/arm/MIMXRT1172xxxxx_sdram.scf" version="1.0.0" projectpath="MIMXRT1172/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/arm/MIMXRT1172xxxxx_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1172/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/gcc/MIMXRT1172xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1172/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/gcc/MIMXRT1172xxxxx_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1172/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/gcc/MIMXRT1172xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1172/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/gcc/MIMXRT1172xxxxx_sdram.ld" version="1.0.0" projectpath="MIMXRT1172/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/gcc/MIMXRT1172xxxxx_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1172/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1172/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1172/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1172/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_sdram.icf" version="1.0.0" projectpath="MIMXRT1172/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1172xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1172/iar/MIMXRT1172xxxxx_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1172/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1172" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1172</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1172/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1172/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1172/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1172/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1172/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1172/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1172/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1172/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1172/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1172_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1172/iar/startup_MIMXRT1172.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1172/gcc/startup_MIMXRT1172.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1172/arm/startup_MIMXRT1172.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1172_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1172_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/system_MIMXRT1172.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1172/system_MIMXRT1172.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1172/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.3.2" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
