vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1172_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.5" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="elcdif" Cversion="2.1.0" condition="driver.elcdif.condition_id">
      <description>ELCDIF Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_elcdif.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_elcdif.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enc" Cversion="2.2.1" condition="driver.enc.condition_id">
      <description>ENC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_enc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_enc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enet" Cversion="2.9.3" condition="driver.enet.condition_id">
      <description>ENET Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_enet.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_enet.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.4" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan" Cversion="2.14.4" condition="driver.flexcan.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_flexcan.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_flexcan.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan_edma" Cversion="2.12.1" condition="driver.flexcan_edma.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_flexcan_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_flexcan_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.1" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1172/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1172/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1172/drivers/"/>
      </files>
    </component>
